import spacy


nlp = spacy.load("satya")
doc = nlp("""
सप्तरीको राजगढ गाउँपालिकामा विभिन्न माग राखी स्थानीय बासिन्दा र उक्त पालिकाका बहुमत जनप्रतिनिधिले गरिरहेका चरणवद्ध आन्दोलनको समाचार संकलनका क्रममा पत्रकारमाथि पालिका अध्यक्ष ओमप्रकाश मण्डलले गरेको दुर्व्यवहार र समाचार संकलनमा गरिएको अवरोधको घटनाप्रति नेपाल पत्रकार महासंघको ध्यानाकर्षण भएको छ ।

महासंघ सप्तरी शाखाका अनुसार साउन २२ गते मंगलबार समाचार संकलनका लागि उक्त गाउँपालिका पुगेका महासंघ सप्तरीका सचिव एवं कान्तिपुर टेलिभिजनका सम्वाददाता रामनारायण विश्वास, कोषाध्यक्ष नवीनकुमार गुप्ता, सदस्य विद्यानन्द रामलगायतलाई पालिका अध्यक्ष मण्डलको प्रत्यक्ष संलग्नतामा दुर्व्यवहार र समाचार संकलनमा अवरोध गरिएको थियो ।

सो क्रममा पत्रकारको परिचय दिँदादिँदै गापा अध्यक्ष मण्डलले ‘मेरो अनुमती बिना यो कार्यालय कसरी प्रवेश गरेको‚ यो अफिसको मालिक म हो‚ मेरो आदेशबिना केही हुँदैन, मेरो आदेश बिना हाकिमको कार्यकक्ष किन प्रवेश गरेको’ भन्दै जंगिदै कुटपिटको प्रयाससमेत गर्नुका साथै उनका समर्थकहरुले कान्तिपुर टेलिभिजनको माइक खोसेर तीनैजना पत्रकारलाई करिब १० मिनेट थुनेर राखिएको शाखाले जनाएको छ ।

कुनै पनि सार्वजनिक विषयका समाचार र सूचनालाई नागरिक र सरोकारवाला निकायमा पु¥याउन भूमिका निर्वाह गर्ने पत्रकारलाई सघाउनुको साटो सार्वजनिक पदमा वहाल अध्यक्षजस्तो जिम्मेवार व्यक्तिबाट पत्रकारमाथि गरिएको यो व्यवहार अत्यन्त निन्दनीय, अशोभनीय र अमर्यादित छ ।

अध्यक्ष मण्डलको यो हर्कतले प्रेस स्वतन्त्रतामा आघात पुग्नुका साथै प्रचलित कानुनको समेत उल्लंघन भएको महासंघको ठहर छ । महासंघ प्रेस स्वतन्त्रताविरोधी यो घटनाको छानबिन गरी दोषीउपर कानुनी कारबाहीको प्रक्रिया अगाडि बढाइ प्रेसको संवैधानिक अधिकारको सम्मान गर्न सम्बन्धित निकायको ध्यानाकर्षण गराउँदछ ।

 

रोसन पुरी

महासचिव
""")
for ent in doc.ents:
    print(ent.text, ent.label_)
